## DataFrame

In [1]:
import pandas as pd

In [2]:
list1 = [2,3,4,3,2,4,44,3]
list1

[2, 3, 4, 3, 2, 4, 44, 3]

In [3]:
pd.DataFrame(list1)

    0
0   2
1   3
2   4
3   3
4   2
5   4
6  44
7   3

In [8]:
#Jitu = [{"Name":"Jitu","age":21,"city":"jaipur","DOB":2003}]
#Ribhu =[{"Name":"Ribhu","age":25,"city":"Patna","DOB":1999}]
Name = ["Jitu","Ribhu","Piyush"]
Age = [21,25,19]
City = ["Jaipur","Patna","Jaipur"]
DOB = [2003,1999,2004]
df = pd.DataFrame([Name,Age,City,DOB])
df

        0      1       2
0    Jitu  Ribhu  Piyush
1      21     25      19
2  Jaipur  Patna  Jaipur
3    2003   1999    2004

In [13]:
frame = {"Name" : ["Jitu","Ribhu","Piyush"],
"Age":[21,25,19],
"City":["Jaipur","Patna","Jaipur"],
"DOB":[2003,1999,2004]}

df = pd.DataFrame(frame,index=[1,2,3])
df

     Name  Age    City   DOB
1    Jitu   21  Jaipur  2003
2   Ribhu   25   Patna  1999
3  Piyush   19  Jaipur  2004

In [24]:
df["College"]=["Sbcet","Sbcet","Sbcet"]
df["Year Of passing"] = [2025,2025,2025]
df

     Name  Age    City   DOB College  Year Of passing
1    Jitu   21  Jaipur  2003   Sbcet             2025
2   Ribhu   25   Patna  1999   Sbcet             2025
3  Piyush   19  Jaipur  2004   Sbcet             2025

In [32]:
pd.Series("Jitu", index = [1,2,3,4,5,6,7,8,9,10],dtype = str,name="jitu")

1     Jitu
2     Jitu
3     Jitu
4     Jitu
5     Jitu
6     Jitu
7     Jitu
8     Jitu
9     Jitu
10    Jitu
Name: jitu, dtype: object

In [34]:
pd.Series({1:"a",2:"b",3:"c",4:"d",5:"e",6:"f"})

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [35]:
df

     Name  Age    City   DOB College  Year Of passing
1    Jitu   21  Jaipur  2003   Sbcet             2025
2   Ribhu   25   Patna  1999   Sbcet             2025
3  Piyush   19  Jaipur  2004   Sbcet             2025

In [57]:
df[0:1]

   Name  Age    City   DOB College  Year Of passing
1  Jitu   21  Jaipur  2003   Sbcet             2025

In [58]:
max(df)

'Year Of passing'

In [59]:
min(df)

'Age'

In [153]:
a1 = {'A':pd.Series([10,20,30,40,50,60,70,80]),
       'B':pd.Series([2,4,2,54,44,3,5,45])}
a1 = pd.DataFrame(a1)
a1

    A   B
0  10   2
1  20   4
2  30   2
3  40  54
4  50  44
5  60   3
6  70   5
7  80  45

In [158]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.rand(400,5),index = np.arange(400))
df

            0         1         2         3         4
0    0.371466  0.527327  0.742471  0.046900  0.125187
1    0.332538  0.311823  0.784669  0.985974  0.914126
2    0.690856  0.488950  0.436001  0.666639  0.702239
3    0.778619  0.757983  0.040386  0.095759  0.274187
4    0.939675  0.909496  0.286354  0.411998  0.673760
..        ...       ...       ...       ...       ...
395  0.986391  0.606421  0.098201  0.587183  0.142799
396  0.741060  0.397916  0.638186  0.241883  0.823038
397  0.618040  0.252652  0.930992  0.190790  0.276203
398  0.444991  0.258483  0.540188  0.390919  0.680361
399  0.700299  0.465410  0.026513  0.398044  0.923367

[400 rows x 5 columns]

In [159]:
df.head()

          0         1         2         3         4
0  0.371466  0.527327  0.742471  0.046900  0.125187
1  0.332538  0.311823  0.784669  0.985974  0.914126
2  0.690856  0.488950  0.436001  0.666639  0.702239
3  0.778619  0.757983  0.040386  0.095759  0.274187
4  0.939675  0.909496  0.286354  0.411998  0.673760

In [160]:
df.tail()

            0         1         2         3         4
395  0.986391  0.606421  0.098201  0.587183  0.142799
396  0.741060  0.397916  0.638186  0.241883  0.823038
397  0.618040  0.252652  0.930992  0.190790  0.276203
398  0.444991  0.258483  0.540188  0.390919  0.680361
399  0.700299  0.465410  0.026513  0.398044  0.923367

In [161]:
df.describe()

                0           1           2           3           4
count  400.000000  400.000000  400.000000  400.000000  400.000000
mean     0.498163    0.496120    0.507040    0.505905    0.477259
std      0.286156    0.294840    0.286162    0.291549    0.278083
min      0.008773    0.005609    0.001937    0.000380    0.002292
25%      0.236607    0.231247    0.269887    0.258605    0.256765
50%      0.475031    0.487867    0.521752    0.512403    0.449266
75%      0.763454    0.758893    0.748280    0.770646    0.713375
max      0.996732    0.999995    0.999090    0.999648    0.996153

## Series

In [61]:
import numpy as np

In [63]:
a = np.random.randint(1,10,12)
a

array([1, 5, 3, 2, 4, 8, 9, 4, 9, 1, 7, 2])

In [78]:
a = pd.Series(a , index=[i for i in range(1,len(a)+1)])
a

1     1
2     5
3     3
4     2
5     4
6     8
7     9
8     4
9     9
10    1
11    7
12    2
dtype: int32

In [91]:
a[1]
a[1:3]
a[:]     # Complete Series
a[::-1]  # Reverse the index
a[::2]   # Jumping/Skipping the indexes

C:\Users\Dell\AppData\Local\Temp\ipykernel_14036\3824393332.py:2: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  a[1:3]

1     1
3     3
5     4
7     9
9     9
11    7
dtype: int32

In [92]:
a[a>3]

2     5
5     4
6     8
7     9
8     4
9     9
11    7
dtype: int32

## Mathematical Operations

In [101]:
s1 = np.random.randint(1,2000,8)
s1 = pd.Series(s1 , index = [i for i in range(1,len(s1)+1)])
s2 = np.random.randint(1,300,5)
s2 = pd.Series(s2)
s2

0    148
1    195
2     47
3    178
4    163
dtype: int32

In [102]:
s =s1+s2
print(s)

0       NaN
1    1742.0
2     323.0
3    1251.0
4    1380.0
5       NaN
6       NaN
7       NaN
8       NaN
dtype: float64

In [103]:
s1 = np.random.randint(1,2000,8)
s1 = pd.Series(s1 , index = [i for i in range(1,len(s1)+1)])
s2 = np.random.randint(1,300,5)
s2 = pd.Series(s2, index = [i for i in range(1,len(s2)+1)])
s2

1     82
2     65
3    243
4    217
5    208
dtype: int32

In [105]:
s = s1+s2
s

1     439.0
2    1183.0
3    1002.0
4     369.0
5     217.0
6       NaN
7       NaN
8       NaN
dtype: float64

In [126]:
s1-s2

1     275.0
2    1053.0
3     516.0
4     -65.0
5    -199.0
6       NaN
7       NaN
8       NaN
dtype: float64

In [127]:
s1*s2

1     29274.0
2     72670.0
3    184437.0
4     32984.0
5      1872.0
6         NaN
7         NaN
8         NaN
dtype: float64

In [128]:
s1/s2

1     4.353659
2    17.200000
3     3.123457
4     0.700461
5     0.043269
6          NaN
7          NaN
8          NaN
dtype: float64

In [129]:
s1%s2

1     29.0
2     13.0
3     30.0
4    152.0
5      9.0
6      NaN
7      NaN
8      NaN
dtype: float64

In [112]:
s.sum()

3210.0

In [113]:
max(s)

1183.0

In [114]:
min(s)

217.0

In [117]:
s.mean()

642.0

In [119]:
s.mode()

0     217.0
1     369.0
2     439.0
3    1002.0
4    1183.0
dtype: float64

In [120]:
s.info()

<class 'pandas.core.series.Series'>
Int64Index: 8 entries, 1 to 8
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      float64
dtypes: float64(1)
memory usage: 128.0 bytes

In [121]:
s.describe()

count       5.000000
mean      642.000000
std       423.864365
min       217.000000
25%       369.000000
50%       439.000000
75%      1002.000000
max      1183.000000
dtype: float64

In [134]:
s,s1,s2
pd.Series([s,s1,s2])

0    1     439.0
2    1183.0
3    1002.0
4     369....
1    1     357
2    1118
3     759
4     152
5     ...
2    1     82
2     65
3    243
4    217
5    208
d...
dtype: object